#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
aws_eip.nat_eip: Refreshing state... [id=eipalloc-00add860ae37921fa]
aws_vpc.tc_vpc: Refreshing state... [id=vpc-0fd3009673ff6d957]
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-03e834292d76d73f5]
aws_internet_gateway.tc_internet_gateway: Refreshing state... [id=igw-0029a9f71521e7635]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-06d47329ae9b91f03]
aws_security_group.eks_sg: Refreshing state... [id=sg-0851230ce2d2c12bf]
aws_subnet.private_subnet_1: Refreshing state... [id=subnet-0e9febe680bb95b57]
aws_subnet.private_subnet_2: Refreshing state... [id=subnet-073a737a5cdbf7702]
aws_route_table.public_route_table: Refreshing state... [id=rtb-02609bf1e6db2b0bd]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-057b0ba5e7b31a3ed]
aws_route_table.private_route_table: Refreshing state... [id=rtb-09b50f8e82ca99375]
aws_eks_cluster.tc_eks_cluster: Refreshing state... [id=eks_lanchonete-do-bairro]
aws_route_table_association.public_association_1: Refreshing state... [id=rtbassoc-056802f6acb70030f]
aws_route_table_association.public_association_2: Refreshing state... [id=rtbassoc-0707d6cb4cf672a30]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0781c0b1377fdf04c]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-03c6d8a5321b39a45]
aws_eks_access_policy_association.tc_eks_policy: Refreshing state... [id=eks_lanchonete-do-bairro#arn:aws:iam::533267423197:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_entry.access-entry: Refreshing state... [id=eks_lanchonete-do-bairro:arn:aws:iam::533267423197:role/voclabs]
aws_eks_node_group.tc_eks_node_group: Refreshing state... [id=eks_lanchonete-do-bairro:ng-lanchonete-do-bairro]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.lanchonetedobairro will be created
  + resource "helm_release" "lanchonetedobairro" {
      + atomic                     = false
      + chart                      = "./helm/lanchonetedobairro_chart"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "lanchonetedobairro"
      + namespace                  = "dev"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespace: default
                
                # API
                apiName: lanchonetedobairro-api
                apiImage: 
                  name: aleehcr/lanchonetedobairro_api
                  tag: integration_v3
                apiNodePort: 30200
                
                # DB
                dbName: lanchonetedobairro-db
                
                # Cronjobs
                removerPedidosImage: 
                  name: aleehcr/lanchonetedobairro_remover_pedidos_job
                  tag: 1
                
                # Config map
                configmap:
                  name: lanchonetedobairro-config-map
                  data:
                    DB_HOST: ""
                    DB_PORT: ""
                    DB_USER: ""
                    DB_NAME: "" 
                
                # Mercado Pago config map
                mpConfigMap:
                  name: mercadopago-config-map
                  data:
                    USERID: ""
                    ACCESS_KEY: ""
                    NOTIFICATION_URL: ""
                    POS_ID: ""
                
                # Secret
                secret:
                  name: secret
            EOT,
          + <<-EOT
                namespace: dev
                
                # Config map
                configmap:
                  data:
                    DB_HOST: 
                    DB_PORT: 5432
                    DB_USER: tc3user
                    DB_NAME: lanchonetedobairro 
                
                # Mercado Pago config map
                mpConfigMap:
                  data:
                    USERID: "1954504909"
                    ACCESS_KEY: ""
                    NOTIFICATION_URL: ""
                    POS_ID: "TOTEM1"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "DB_HOST"
          + value = "toreplace"
            # (1 unchanged attribute hidden)
        }
    }

  # kubernetes_namespace.dev will be created
  + resource "kubernetes_namespace" "dev" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "dev-annotation"
            }
          + generation       = (known after apply)
          + name             = "dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*